Revit 2027 API
AreaBasedLoadData.AreaBasedLoadType Property
 The electrical area based load type of the area based load.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId AreaBasedLoadType { get; set; }
Public Property AreaBasedLoadType As ElementId
	Get
	Set
public:
property ElementId^ AreaBasedLoadType {
	ElementId^ get ();
	void set (ElementId^ value);
}
member AreaBasedLoadType : ElementId with get, set
Property Value
ElementId
Exceptions
Exception | Condition
ArgumentException |  When setting this property: The id isn't a valid area based load type.
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
AreaBasedLoadData Class
Autodesk.Revit.DB.Electrical Namespace